Update orbis and orbis-search documentation
